AtomizationFoam/run/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid air);

liquid
{
    transportModel  Newtonian;

    nu              1e-06;

    rho             1000;
}

air
{
    transportModel  Newtonian;

    nu              8e-07;

    rho             23;
}
KProperties
{
    // Pure-component densities [kg/m^3] used in the volume-additive mixing rule:
    //   1/rho1 = 0.7*K/rhoEthanol + 0.98*(1-K)/rhoH2O2 + (0.02+0.28*K)/rhoWater
    // K=0 -> ~98% H2O2 / 2% water liquid  (rho ~ 1427 kg/m^3)
    // K=1 -> 70% ethanol / 30% water liquid (rho ~ 868 kg/m^3)
    // Verify these against your reference data / EOS before production runs.
    rhoEthanol      789.0;    // pure ethanol at ~20 °C, kg/m^3
    rhoH2O2         1450.0;   // pure H2O2 at ~20 °C, kg/m^3
    rhoWater        998.2;    // pure water at ~20 °C, kg/m^3

    mu1Eth		1.59e-03;
	mu1H2O2 	1.26e-03;

	sigmaIntercept	0.0799;
	sigmaSlope	-0.0519;

	sigmaCubic       0.01973518;   // K^3 coeff, N/m -- Parachor-method fit (Sugden), see notes
        sigmaQuad        -0.04875952;  // K^2 coeff, N/m
    	sigmaLin         -0.01634568;  // K^1 coeff, N/m
        sigmaConst        0.07717014;  // K^0 coeff, N/m (= sigma at K=0, i.e. ~98% H2O2/water)
}




sigma   0.04;


// ************************************************************************* //
